       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGNMENT2.

      *> AUTHOR: Tito Kinyambu
      *> DATE: June 23, 2026
      *> PURPOSE: My first COBOL program - display greetings

       PROCEDURE DIVISION.
           DISPLAY 'Welcome to FAC Academy COBOL!'.
           DISPLAY 'I am learning COBOL.'.
      *> Program ends here
           STOP RUN.
