       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGNMENT1.

       PROCEDURE DIVISION.
           DISPLAY 'Welcome to FAC Academy COBOL!'.
           DISPLAY 'I am learning COBOL.'.
           STOP RUN.
